/**
 * Created by dantegg on 16-10-24.
 *
 *保存一些常量
 */


//首页临时热门课程
export const tempCourse = [
    {
        "courseName":"雾霾",
        "teacherName":"于天贞",
        "courseId":"44c301ed-ec92-4e07-bc26-0fddf33266d9"
    },
    {
        "courseName":"怎样防晒最科学",
        "teacherName":"智而仁课程研发中心",
        "courseId":"2f3d06ff-0343-4caa-b81d-ac540ec23eb8"
    },
    {
        "courseName":"3D打印与三维设计",
        "teacherName":"胡伟",
        "courseId":"fd8f20a7-5c2d-4aa2-9b8d-71541d971037"
    },
    {
        "courseName":"绚烂下的无形杀手--光污染",
        "teacherName":"于天贞",
        "courseId":"64cdb0e9-ee03-49ba-9d44-dba4ad78b1c6"
    },
    {
        "courseName":"邻避效应,挑战与应对",
        "teacherName":"智而仁课程研发中心",
        "courseId":"ee37ad4f-c4d4-4938-bde5-002b069fe9b1"
    },
    {
        "courseName":"如何创建一门慕课",
        "teacherName":"陈玉琨",
        "courseId":"f7a73627-4330-4299-8c70-6a8bb9491f42"
    }
]


//首页临时右侧竖向轮播
export const tempVerticalCourse = [
    {
        "verticalPicUrl":"../img/homepage/3dprint.jpg",
        "courseId":'fd8f20a7-5c2d-4aa2-9b8d-71541d971037'
    },
    {
        "verticalPicUrl":"../img/homepage/robot.jpg",
        "courseId":"3c992ad4-1e0e-4592-b6fe-16ed1c539679"
    }
]

//首页临时大图
export const tempHighLight = [
    {
        "highLightUrl":"../img/homepage/alphago.jpg",
        "courseId":'a70affb5-5ea3-40c2-9d6c-92f2023788ba'
    }
]

export const relateSubjects = [
    {"id":"语文","name":"语文"},
    {"id":"数学","name":"数学"},
    {"id":"外语","name":"外语"},
    {"id":"物理","name":"物理"},
    {"id":"化学","name":"化学"},
    {"id":"生物","name":"生物"},
    {"id":"历史","name":"历史"},
    {"id":"政治","name":"政治"},
    {"id":"地理","name":"地理"},
    {"id":"体育","name":"体育"},
    {"id":"音乐","name":"音乐"},
    {"id":"美术","name":"美术"},
    {"id":"信息技术","name":"信息技术"},
    {"id":"通用技术","name":"通用技术"},
]//涉及学科


export const courseType = [
    {"id":"1","name":"科技创新类"},
    {"id":"2","name":"人文历史类"},
    {"id":"3","name":"社会服务类"},
    {"id":"4","name":"艺术体育类"},
    {"id":"5","name":"时事政治类"}
] //课程类型

export const fitObject = [
    {"id":"初中生","name":"初中生"},
    {"id":"高中生","name":"高中生"}
]  //适用对象

// 首页-学校的展示数据信息
export const schoolData = [
    {
        name: "清华大学附属中学",
        descp: "清华大学附属中学位于美丽的清华园中，西临著名的圆明园，是教育部直属大学附中、北京市重点中学、国家级体育传统项目学校.",
        img: "qhfz",
        icon: "qinghuafuzhong"
    },{
        name: "上海市格致中学",
        descp: "上海市格致初级中学是地处繁华南京路的一所完中机制的初中。学校始建于1871年，前身为晓明女子中学、第六女子中学和市六中学。",
        img: "gzzx",
        icon: "shanghaigezhi"
    },{
        name: "杭州育才中学",
        descp: "杭州育才中学属民办公助性质的初级中学，学校位于杭州市拱墅区冠军路8号。",
        img: "hzyc",
        icon: "hangzhouyucai"
    },{
        name: "青岛第二中学",
        descp: "山东省青岛第二中学位于青岛高科园，背依崂山，南临黄海，风景秀丽。",
        img: "qd2z",
        icon: "qingdao2"
    },{
        name: "江苏省苏州中学",
        descp: "江苏省苏州中学，简称苏州中学、苏高中、苏中，位于中国江苏省苏州市姑苏区，苏州市区第一所国家示范级高中，2004年首批成为四星级中学。",
        img: "suzhouschool-img",
        icon: "suzhouschool-icon"
    },{
        name: "江苏张家港常春藤实验中学",
        descp: "常青藤实验中学坐落于全国首批文明城市——张家港市市区中心地段，是莘莘学子理想的求学之地。自2000年建校以来，一直秉承“使命引领、科学取向、和而不同、臻于至善”的办学理念，着力培育“永远向上，永不放弃、永无止境”的常青藤人。",
        img: "jszjg-cctsyzx",
        icon: "jszjg-cctsyzx-icon"
    },{
        name: "南京市金陵中学",
        descp: "南京市金陵中学创建于1888年。现为江苏省首批四星级高中、江苏省首批普通高中创新拔尖人才培养试点学校、江苏省模范学校、江苏省德育先进学校、首批国家级示范高中、全国体育红旗学校、全国群众体育先进集体、全国中小学现代教育技术实验学校。",
        img: "njs-jlzx",
        icon: "njs-jlzx-icon"
    },{
        name: "南京外国语学校",
        descp: "于1963年建校,学校以“培养有中国灵魂、世界胸怀的现代人”为目标，全面提高学生的综合素质；经过半个世纪的不懈求索，如今的南外已经成为一所特色鲜明、优势突出的现代化开放型学校，为国家培养了一大批有外语特长、文理兼通的国际化复合型人才。",
        img: "njs-wgyzx",
        icon: "njs-wgyzx-icon"
    },{
        name: "泉州市第五中学",
        descp: "创建于1902年，其前身泉州府官立中学堂是八闽大地最早开办的八所新式公立中学之一。该校在教育实践中，以较高的教育教学质量饮誉八闽大地；2001年高考，本科上线率达88%，该校学生1999年、2001年高考中夺得全省文科状元。",
        img: "qzs-dwzx",
        icon: "qzs-dwzx-icon"
    },{
        name: "泉州市第一中学",
        descp: "泉州第一中学位于泉州市区梅石路学府街，北枕清源山，西伴梅石路。前身可追溯至明朝成化二年的罗伦状元在此开坛讲学，延续至今已有五百四十余年的历史。2003年被省教育厅确认为福建省首批“示范性普通高级中学”；2012年被确认为福建省义务教育标准化学校，全国“百所数字校园示范校建设项目学校”。",
        img: "qzs-dyzx",
        icon: "qzs-dyzx-icon"
    },{
        name: "苏州市景范中学",
        descp: "学校校址原为北宋名相范仲淹创办的义庄旧址。学校历史悠久，如追溯到文正书院[元至正六年（公元1346年）]则距今已600余年。学校几经易名。1989年十月，值范仲淹诞辰一千周年之季，为弘扬范公“先天下之忧而忧，后天下之乐而乐”的崇高精神，学校复名为景范中学。",
        img: "szs-jfzx",
        icon: "szs-jfzx-icon"
    },{
        name: "北京市第三十五中学",
        descp: "北京市第三十五中学始建于1923年，前身为志成中学。李大钊、邓萃英等建校董事们提出的办学宗旨是：“改变民族落后，发展教育事业，培养栋梁之才，有志者事竟成”。2012年入选自主排课与会考实验校，2013年推行“学部制”“走班制”“学分制”“导师制”“学长制”改革，三十五中在改革创新中阔步向前！",
        img: "bjs-dsswzx",
        icon: "bjs-dsswzx-icon"
    },{
        name: "北京市新英才学校",
        descp: "北京市新英才学校是一所集特色双语幼儿园、精品小学、优质初中、多元优质高中、剑桥国际中心、国外大学预科、汉语中心为一体的寄宿制国际化学校。学校建立以“爱与创造”为核心精神的育人目标体系，致力于为学生提供卓越的与世界同步的教育课程及体验。",
        img: "bjs-xyczx",
        icon: ""
    },{
        name: "广州市执信中学",
        descp: "广州市执信中学是孙中山先生于1921年为纪念朱执信而亲手创办的一所纪念性学校。在九十年的风雨历程中，执信中学始终与祖国同行，与时代同步，与改革共进，与光荣相伴。今天，执信中学制定了新的发展规划，努力增创发展新优势，提升办学品位和层次，打响品牌，追求卓越，致力于把执信中学办成特色明、条件优、质量一流、省内领先、国内有影响、国际知名的现代化中学。",
        img: "gzs-zxzx",
        icon: "gzs-zxzx-icon"
    },{
        name: "上海民办华二初级中学",
        descp: "上海民办华二初级中学，是教育部直属重点中学——华东师范大学第二附属中学承办的民办初中，也是华东师范大学的教育实验基地。由华东师大二附中派出上海市特级校长领衔的管理团队及骨干教师，践行华东师大二附中“卓然独立、越而胜己”的办学理念，传承“追求卓越、崇尚创新”的校园文化精神，努力创建具有科技特色的二附中优质生源基地。 ",
        img: "shs-mbhecjzx",
        icon: "shs-mbhecjzx-icon"
    },{
        name: "上海市曹杨二中",
        descp: "创建于1954年。1979年被认定为上海市重点中学。江泽民同志1989年为学校题词“勤奋进取，求实创新”，成为激励二中人的学校精神。2011年12月，学校荣获全国文明单位称号。学校先后十四次被评为上海市文明单位，目前是上海市与教育部合作的“创新素养培育实验项目”学校。",
        img: "shs-cyez",
        icon: "shs-cyez-icon"
    },{
        name: "上海市市西中学",
        descp: "市西中学坐落在市中心环境幽静的愚园路上，是首批命名的实验性示范性高中，学校现有28个教学班，学生850人。学校源于1869年创建的“尤来旬学校”，1946年正式命名为市西中学。1953年，市西中学经上海市人民政府命名为首批市重点中学。",
        img: "shs-sxzx",
        icon: "shs-sxzx-icon"
    },{
        name: "上海市兴陇中学",
        descp: "兴陇中学是一所实施四年制初中教育的公办全日制教育机构。学校秉承“融情、优教、乐学、求真 ”的办学理念，追求把“立德树人”作为浸润在课程实施全过程的教育境界，努力把培养“感情丰富，人格健全”的学生当作使命，为学生接受优质教育营造了良好的校园文化氛围。",
        img: "shs-xlzx",
        icon: "shs-xlzx-icon"
    },{
        name: "上海市延河中学",
        descp: "延河中学是一所普通初级中学。学校提出了“教学生四年，为学生想40年，为国家、为民族想400年”的办学思想，始终坚持面向全体学生，重视学生全面而富有个性地主动发展，重视培养学生的创新精神和实践能力。",
        img: "shs-yhzx",
        icon: "shs-yhzx-icon"
    },{
        name: "深圳市华侨城中学",
        descp: "深圳市华侨城中学成立于1981年。三十年来，学校同深圳经济特区一起成长，走过了一段由规模发展到内涵发展的辉煌历程，成为一所办学理念先进、办学特色鲜明、教学质量优良、办学效益显著的广东省一级学校，跻身于广东省名校行列。",
        img: "szs-hqczx",
        icon: "szs-hqczx-icon"
    },{
        name: "中山市实验中学",
        descp: "中山市实验中学是广东省国家级示范性普通高中，前身是创建于1913年的中山师范学校，2000年转型为普通中学，现有教职员工386人，学生5723人，学校地处中山城区，占地面积500余亩，建筑面积13万平方米，湖光翠色，石景水榭，鸟语花香，美不胜收。",
        img: "zss-syzx",
        icon: "zss-syzx-icon"
    },{
        name: "成都七中初中学校",
        descp: " 四川省成都市第七中学初中学校成立于2008年9月，四川省成都市第七中学初中学校座落于天府新城永安片区科华路南延线和三环路交汇处，是一所由高新区管委会和成都七中联合举办的直属于高新区管委会的普通公办初级中学，是服务于成都市向东向南发展战略，按照高起点、高标准的要求建设的现代化、有特色的具有一定影响的高品质示范性学校。",
        img: "cds-qzczzx",
        icon: "cds-qzczzx-icon"
    },{
        name: "海南省海口美舍学校",
        descp: "学校地处海府路与琼苑路的交岔口，毗邻海南省政府、新南方书城、海南省科技活动中心，形成浓郁的文化氛围，有着“省府之邻、书城之旁、闹中取静、书香味浓”等得天独厚的人文环境。学校有现代化的电子网络教室、多媒体教室、实验室、图书阅览室、校园广播系统、校园闭路监控系统等一应俱全。",
        img: "",
        icon: "hns-hkmszx-icon"
    },{
        name: "合肥市第八中学",
        descp: "合肥市第八中学创办于1956年，时为初级中学，1999年被评为合肥市示范高中，2002年被评为安徽省示范高中。期间数易其址，直至2008年整建制从桐城路老校区搬迁至合肥市政务文化新区，一所全新的现代化八中自此诞生。",
        img: "hfs-dbzx",
        icon: ""
    },{
        name: "郑州外国语学校",
        descp: "郑州外国语是国家教育部确定的全国十六所具有保送生资格的外国语学校之一，全国外国语学校工作研究会理事学校，全国外语教学素质教育实验基地，河南省首批示范性高中，河南省首批高中骨干教师培训基地，教育部国家留学基金委“出国留学人才选拔基地”，河南省对外开放单位、对外交流重点单位。",
        img: "zhs-wgyzx",
        icon: "zhs-wgyzx-icon"
    }
];